neoluxis/stm32-4pin-spi-oled/HARDWARD/src/oled/oled.c
#include "oled/oled.h"
#include "oled/font.h"
#include "stm32f10x.h"

#define OLED_W_CS(x)  GPIO_WriteBit(GPIOB, GPIO_Pin_3, (BitAction)(x))
#define OLED_W_DC(x)  GPIO_WriteBit(GPIOB, GPIO_Pin_4, (BitAction)(x))
#define OLED_W_RES(x) GPIO_WriteBit(GPIOB, GPIO_Pin_5, (BitAction)(x))
#define OLED_W_D1(x)  GPIO_WriteBit(GPIOB, GPIO_Pin_6, (BitAction)(x))
#define OLED_W_D0(x)  GPIO_WriteBit(GPIOB, GPIO_Pin_7, (BitAction)(x))

/**
 * @brief  OLED初始化SPI
 * @param  None
 * @retval None
 */
void OLED_SPI_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO, ENABLE); // 打开GPIO口时钟，先打开复用才能修改复用功能
    GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);                    // 要先开时钟，再重映射；这句表示关闭jtag，使能swd。

    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_7;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    OLED_W_D0(1);
    OLED_W_D1(1);
    OLED_W_RES(1);
    OLED_W_DC(1);
    OLED_W_CS(1);
}

/**
 * @brief  给OLED发送字节
 * @param  Byte: 要发送的字节
 * @retval None
 */
void OLED_SPI_SendByte(uint8_t Byte)
{
    uint8_t i;
    for (i = 0; i < 8; i++) {
        OLED_W_D0(0);
        OLED_W_D1(Byte & (0x80 >> i));
        OLED_W_D0(1);
    }
}

/**
 * @brief  OLED写命令
 * @param  Command 要写入的命令
 * @retval 无
 */
void OLED_WriteCmd(uint8_t Command)
{
    OLED_W_CS(0);
    OLED_W_DC(0);
    OLED_SPI_SendByte(Command);
    OLED_W_CS(1);
}

/**
 * @brief  OLED写数据
 * @param  Data 要写入的数据
 * @retval 无
 */
void OLED_WriteData(uint8_t Data)
{
    OLED_W_CS(0);
    OLED_W_DC(1);
    OLED_SPI_SendByte(Data);
    OLED_W_CS(1);
}

/**
 * @brief  OLED设置光标位置
 * @param  Y 以左上角为原点，向下方向的坐标，范围：0-7
 * @param  X 以左上角为原点，向右方向的坐标，范围：0-127
 * @retval 无
 */
void OLED_SetCursor(uint8_t Y, uint8_t X)
{
    OLED_WriteCmd(0xB0 | Y);                 // 设置Y位置
    OLED_WriteCmd(0x10 | ((X & 0xF0) >> 4)); // 设置X位置高4位
    OLED_WriteCmd(0x00 | (X & 0x0F));        // 设置X位置低4位
}

/**
 * @brief  OLED清屏
 * @param  无
 * @retval 无
 */
void OLED_Clear(void)
{
    uint8_t i, j;
    for (j = 0; j < 8; j++) {
        OLED_SetCursor(j, 0);
        for (i = 0; i < 128; i++) {
            OLED_WriteData(0x00);
        }
    }
}

/**
 * @brief  OLED显示一个字符
 * @param  Line 行位置，范围：1-4
 * @param  Column 列位置，范围：1-16
 * @param  Char 要显示的一个字符，范围：ASCII可见字符
 * @retval 无
 */
void OLED_ShowChar(uint8_t Line, uint8_t Column, char Char)
{
    uint8_t i;
    OLED_SetCursor((Line - 1) * 2, (Column - 1) * 8); // 设置光标位置在上半部分
    for (i = 0; i < 8; i++) {
        OLED_WriteData(OLED_F8x16[Char - ' '][i]); // 显示上半部分内容
    }
    OLED_SetCursor((Line - 1) * 2 + 1, (Column - 1) * 8); // 设置光标位置在下半部分
    for (i = 0; i < 8; i++) {
        OLED_WriteData(OLED_F8x16[Char - ' '][i + 8]); // 显示下半部分内容
    }
}

/**
 * @brief  OLED显示字符串
 * @param  Line 起始行位置，范围：1-4
 * @param  Column 起始列位置，范围：1-16
 * @param  String 要显示的字符串，范围：ASCII可见字符
 * @retval 无
 */
void OLED_ShowString(uint8_t Line, uint8_t Column, char *String)
{
    uint8_t i;
    for (i = 0; String[i] != '\0'; i++) {
        OLED_ShowChar(Line, Column + i, String[i]);
    }
}

/**
 * @brief  OLED显示汉字
 * @param  Line 起始行位置，范围：1-4
 * @param  Column 起始列位置，范围：1-16
 * @param  No：要显示汉字的个数
 * @retval 无
 */
void OLED_ShowChinese(uint8_t Line, uint8_t Column, uint8_t No)
{
    uint8_t i;
    OLED_SetCursor((Line - 1) * 2, (Column - 1) * 16);
    for (i = 0; i < 16; i++) {
        OLED_WriteData(Chinese[2 * No][i]);
    }
    OLED_SetCursor((Line - 1) * 2 + 1, (Column - 1) * 16);
    for (i = 0; i < 16; i++) {
        OLED_WriteData(Chinese[2 * No + 1][i]);
    }
}

/**
 * @brief  OLED次方函数
 * @retval 返回值等于X的Y次方
 */
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
    uint32_t Result = 1;
    while (Y--) {
        Result *= X;
    }
    return Result;
}

/**
 * @brief  OLED显示数字（十进制，正数）
 * @param  Line 起始行位置，范围：1-4
 * @param  Column 起始列位置，范围：1-16
 * @param  Number 要显示的数字，范围：0-4294967295
 * @param  Length 要显示数字的长度，范围：1-10
 * @retval 无
 */
void OLED_ShowNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
    uint8_t i;
    for (i = 0; i < Length; i++) {
        OLED_ShowChar(Line, Column + i, Number / OLED_Pow(10, Length - i - 1) % 10 + '0');
    }
}

/**
 * @brief  OLED初始化
 * @param  无
 * @retval 无
 */
void OLED_Init(void)
{
    OLED_SPI_Init(); // 端口初始化

    OLED_WriteCmd(0xAE); // 关闭显示

    OLED_WriteCmd(0xD5); // 设置显示时钟分频比/振荡器频率
    OLED_WriteCmd(0x80);

    OLED_WriteCmd(0xA8); // 设置多路复用率
    OLED_WriteCmd(0x3F);

    OLED_WriteCmd(0xD3); // 设置显示偏移
    OLED_WriteCmd(0x00);

    OLED_WriteCmd(0x40); // 设置显示开始行

    OLED_WriteCmd(0xA1); // 设置左右方向，0xA1正常 0xA0左右反置

    OLED_WriteCmd(0xC8); // 设置上下方向，0xC8正常 0xC0上下反置

    OLED_WriteCmd(0xDA); // 设置COM引脚硬件配置
    OLED_WriteCmd(0x12);

    OLED_WriteCmd(0x81); // 设置对比度控制
    OLED_WriteCmd(0xCF);

    OLED_WriteCmd(0xD5); // 设置显示时钟分频比/振荡器频率
    OLED_WriteCmd(0x80);

    OLED_WriteCmd(0xD9); // 设置预充电周期
    OLED_WriteCmd(0xF1);

    OLED_WriteCmd(0xDB); // 设置VCOMH取消选择级别
    OLED_WriteCmd(0x30);

    OLED_WriteCmd(0xA4); // 设置整个显示打开/关闭

    OLED_WriteCmd(0xA6); // 设置正常/倒转显示

    OLED_WriteCmd(0x8D); // 设置充电泵
    OLED_WriteCmd(0x14);

    OLED_WriteCmd(0xAF); // 开启显示

    OLED_Clear(); // OLED清屏
}